//配置
{
    const app = window.app || {};
    const data = app.data = {
        COLOR_TO_NUMBER: ['gray', 'purple', 'cyan', 'pink', 'green', 'blue', 'orange', 'colors'],

        // 三角模拟数据
        ALL_ANGLE: [
            { n: 0, c: 1, b: 0 },
            { n: 1, c: 2, b: 0 },
            { n: 2, c: 3, b: 0 },
            { n: 3, c: 4, b: 0 },
            { n: 4, c: 5, b: 0 },
            { n: 5, c: 6, b: 0 },
            { n: 6, c: 7, b: 0 },
            { n: 7, c: 3, b: 0 },
            { n: 8, c: 1, b: 0 },
            { n: 9, c: 2, b: 0 },
            { n: 10, c: 3, b: 0 },
            { n: 11, c: 4, b: 0 },
            { n: 12, c: 5, b: 0 },
            { n: 13, c: 6, b: 0 },
            { n: 14, c: 7, b: 0 },
            { n: 15, c: 3, b: 0 }
        ],

        // 贝塞尔曲线的中间点
        BEZIER_MIDDLEPOS: [
            { x: 0, y: 313 },

            { x: 0, y: 388 },
            { x: 0, y: 288 },
            { x: 0, y: 268 },

            { x: 115, y: 146 },
            { x: 40, y: 160 },
            { x: 0, y: 130 },
            { x: -90, y: 157 },
            { x: -140, y: 120 },

            { x: 90, y: 180 },
            { x: 0, y: 170 },
            { x: 0, y: 200 },
            { x: -90, y: 124 },
            { x: -100, y: 100 },
            { x: -120, y: 90 },
            { x: -200, y: 100 }
        ],

        // 各三角的终点坐标
        END_POSITION_LIST: [
            { isUp: true, x: 307, y: 125 },

            { isUp: true, x: 245, y: 251 },
            { isUp: false, x: 311, y: 234 },
            { isUp: true, x: 388, y: 236 },

            { isUp: true, x: 182, y: 371 },
            { isUp: false, x: 249, y: 360 },
            { isUp: true, x: 326, y: 358 },
            { isUp: false, x: 392, y: 344 },
            { isUp: true, x: 467, y: 346 },

            { isUp: true, x: 120, y: 494 },
            { isUp: false, x: 185, y: 478 },
            { isUp: true, x: 261, y: 478 },
            { isUp: false, x: 329, y: 465 },
            { isUp: true, x: 405, y: 467 },
            { isUp: false, x: 472, y: 454 },
            { isUp: true, x: 549, y: 454 }
        ],

        // 删除的高光坐标
        CANCEL_LIGHT_POS: [
            { direction: 0, x: 299, y: 145 },

            { direction: 1, x: 238, y: 226 },
            { direction: 1, x: 322, y: 224 },

            { direction: 0, x: 236, y: 272 },
            { direction: 0, x: 380, y: 258 },

            { direction: 1, x: 171, y: 343 },
            { direction: 1, x: 251, y: 340 },
            { direction: 1, x: 325, y: 337 },
            { direction: 1, x: 401, y: 332 },

            { direction: 0, x: 171, y: 392 },
            { direction: 0, x: 317, y: 378 },
            { direction: 0, x: 460, y: 365 },

            { direction: 1, x: 112, y: 474 },
            { direction: 1, x: 187, y: 471 },
            { direction: 1, x: 256, y: 454 },
            { direction: 1, x: 332, y: 457 },
            { direction: 1, x: 405, y: 444 },
            { direction: 1, x: 480, y: 437 }

        ],

        // 高亮光线与索引的对应关系
        LIGHT_AND_INDEX_TABLE: {
            '0-2': 0,
            '1-2': 1,
            '2-3': 2,
            '1-5': 3,
            '3-7': 4,
            '4-5': 5,
            '5-6': 6,
            '6-7': 7,
            '7-8': 8,
            '4-10': 9,
            '6-12': 10,
            '8-14': 11,
            '9-10': 12,
            '10-11': 13,
            '11-12': 14,
            '12-13': 15,
            '13-14': 16,
            '14-15': 17
        },

        // 本地模拟数据
        LOCAL_DATA: {
            "code": 0,
            "type": 1,
            "initial": [{
                "n": 0,
                "c": 2,
                "b": 1
            }, {
                "n": 1,
                "c": 1,
                "b": 1
            }, {
                "n": 2,
                "c": 6,
                "b": 0
            }, {
                "n": 3,
                "c": 1,
                "b": 0
            }, {
                "n": 4,
                "c": 8,
                "b": 0
            }, {
                "n": 5,
                "c": 1,
                "b": 0
            }, {
                "n": 6,
                "c": 2,
                "b": 0
            }, {
                "n": 7,
                "c": 6,
                "b": 0
            }, {
                "n": 8,
                "c": 8,
                "b": 0
            }, {
                "n": 9,
                "c": 7,
                "b": 0
            }, {
                "n": 10,
                "c": 1,
                "b": 0
            }, {
                "n": 11,
                "c": 8,
                "b": 0
            }, {
                "n": 12,
                "c": 3,
                "b": 0
            }, {
                "n": 13,
                "c": 7,
                "b": 0
            }, {
                "n": 14,
                "c": 3,
                "b": 0
            }, {
                "n": 15,
                "c": 7,
                "b": 0
            }],
            "change": [{
                "remove": [{
                    "triangle": [{
                        "n": 3,
                        "c": 1,
                        "b": 0
                    }, {
                        "n": 4,
                        "c": 8,
                        "b": 0
                    }, {
                        "n": 5,
                        "c": 1,
                        "b": 0
                    }, {
                        "n": 11,
                        "c": 8,
                        "b": 0
                    }, {
                        "n": 10,
                        "c": 1,
                        "b": 0
                    }],
                    "prize_color": 4,
                    "prize": 0.5,
                    "prize_amount": 100
                }, {
                    "triangle": [{
                        "n": 7,
                        "c": 1,
                        "b": 0
                    }, {
                        "n": 8,
                        "c": 8,
                        "b": 0
                    }, {
                        "n": 12,
                        "c": 1,
                        "b": 0
                    }, {
                        "n": 13,
                        "c": 8,
                        "b": 0
                    }, {
                        "n": 15,
                        "c": 1,
                        "b": 0
                    }],
                    "prize_color": 5,
                    "prize": 0.5,
                    "prize_amount": 2000
                }],

                "fill": [{
                    "n": 3,
                    "c": 2,
                    "b": 0
                }, {
                    "n": 4,
                    "c": 1,
                    "b": 0
                }, {
                    "n": 5,
                    "c": 8,
                    "b": 0
                }, {
                    "n": 11,
                    "c": 6,
                    "b": 0
                }, {
                    "n": 10,
                    "c": 3,
                    "b": 0
                }, {
                    "n": 7,
                    "c": 2,
                    "b": 0
                }, {
                    "n": 8,
                    "c": 1,
                    "b": 0
                }, {
                    "n": 12,
                    "c": 8,
                    "b": 0
                }, {
                    "n": 13,
                    "c": 6,
                    "b": 0
                }, {
                    "n": 15,
                    "c": 3,
                    "b": 0
                }]
            }],
            "rate": 0.5,
            "winAmount": 50,
            "times": 1
        },

        // 错误信息
        ERROR_TEXT: {
            '2': '获取奖池信息失败',
            '3': '参数有误',
            '4': '用户正在投币，请勿刷接口',
            '5': '余额不足，请充值',
            '6': '平台账号已被禁用',
            '7': '游戏账号已被禁用',
            '8': '服务器开小差了，投币额以欢乐值的形式已退回到您的账号了哟~',
            '23': '替换位置有误',
            '24': '长时间未操作，惊喜奖励已结束',
            '25': '该位置已替换',
            '50': '万里通单笔消费达上限',
            '51': '万里通单日积分消费达上限',
            '81': 'OTP',
            '82': '支付渠道被禁用',
            '31': '地球信号不好，请稍后重试~'
        }



    }







}
